/*
	File:		Localizable.strings
	Contains:	Localizable strings for chess
	Version:	2.0
	Copyright:	© 2004-2014 by Apple Computer, Inc., all rights reserved.
*/

"Chess"             = "Chess";
"gc_automatch"      = "Auto-Match Player";
"gc_opponent"       = "Speak Opponent Moves";
"engine_opponent"   = "Speak Computer Moves";
"cant_duplicate_gc" = "Cannot duplicate Game Center games";

/*
  Single letter piece names P(awn) K(night) B(ishop) R(ook) Q(ueen) K(ing)
  
  According to the PGN standard for chess notation, the following letters
  are used internationally:

  Czech        P J S V D K
  Danish       B S L T D K
  Dutch        O P L T D K
  English      P N B R Q K
  Estonian     P R O V L K
  Finnish      P R L T D K
  French       P C F T D R
  German       B S L T D K
  Hungarian    G H F B V K
  Icelandic    P R B H D K
  Italian      P C A T D R
  Norwegian    B S L T D K
  Polish       P S G W H K
  Portuguese   P C B T D R
  Romanian     P C N T D R
  Spanish      P C A T D R
  Swedish      B S L T D K
*/

"pawn_letter" 	= "P";
"knight_letter"	= "N";
"bishop_letter" = "B";
"rook_letter"   = "R";
"queen_letter"  = "Q";
"king_letter"   = "K";

/* 
 * Full piece names for VoiceOver. We can't decompose into color & piece
 * because of gender agreement requirements in some languages.
 */
"versus"        = "versus";
"select_square" = "select";
"promote_to"    = "promote to";
"king"		= "king";
"queen"		= "queen";
"bishop"        = "bishop";
"knight"        = "knight";
"rook"          = "rook";
"pawn"		= "pawn";
"kings"		= "kings";
"queens"        = "queens";
"bishops"       = "bishops";
"knights"       = "knights";
"rooks"         = "rooks";
"pawns"		= "pawns";
"white_king"	= "white king";
"white_queen"	= "white queen";
"white_bishop"	= "white bishop";
"white_knight"	= "white knight";
"white_rook"	= "white rook";
"white_pawn"	= "white pawn";
"black_king"	= "black king";
"black_queen"	= "black queen";
"black_bishop"	= "black bishop";
"black_knight"	= "black knight";
"black_rook"	= "black rook";
"black_pawn"	= "black pawn";

/* Game outcomes and other title messages */
"new_msg"	= "New Game";
"generic_game_name" = "Game";
"generic_game_name_one" = "Game 1";
"draw_msg" 	= "Draw!";
"white_win_msg" = "White wins!";
"black_win_msg" = "Black wins!";
"undo_msg"      = "1 Undo";
"undos_msg"     = "%d Undos";
"hint_msg"      = "1 Hint";
"hints_msg"     = "%d Hints";
"illegal_msg"   = "Illegal Move!";
"white_move_msg"= "White to Move";
"black_move_msg"= "Black to Move";
"takeback_msg"  = "Takeback requested";
"casual_game"	 = "Casual Game";
"engine_player" = "Computer";
"cloud_city"    = "Game Center";
"cloud_country" = "The Cloud";

/* Engine thinking mode */
"fixed_depth_mode"  = "Computer thinks 1 move ahead";
"fixed_depths_mode" = "Computer thinks %d moves ahead";
"fixed_time_mode"   = "Computer thinks 1 second per move";
"fixed_times_mode"  = "Computer thinks %d seconds per move";

/* Formats for window title: 
 *
 * title_move_line_fmt  = Move. (... /) <Last Move>
 * title_move_fmt       = <Piece+Origin> (-/x/@) <Destination+Promotion>
 * 	e.g.		  e2-e4     Nf3xe5     b7xa8=R     B@f7
 * title_check_fmt      = <Move> <Check/Checkmate>
 *  e.g.         Bc4xf7+
 * game_title_fmt     	= <White Player> - <Black Player> (<Last Move/Side To Move>)
 *      e.g.              Alekhine - Casablance (3. ... e7 - e6)
 * game_subtitle_fmt    = <White Player> - <Black Player>
 * game_outcome_fmt     = <Game Title>   <Outcome of Game>
 */
"title_move_line_fmt"	= "%@. %@%@";
"title_move_fmt"        = "%@%@%@";
"title_check_fmt"       = "%@%@";
"game_title_fmt"    	= "%@ | %@ - %@   (%@)";
"game_subtitle_fmt"     = "%@ - %@";
"game_outcome_fmt"	    = "%@   %@";

/* Strings for check / checkmate */
"move_is_check"         = "+";
"move_is_checkmate"     = "≠";

/* Formats for moves in game log. 
 *
 * move_origin_fmt	= <Piece><FromFile><FromRank>
 *     e.g.               e2     Nf3
 * drop_origin_fmt      = <Piece>
 *     e.g.               P      B     R
 * operation_fmt	= - / x / @
 * promo_dest_fmt       = <ToFile><ToRank>=<Piece>
 *     e.g.               a8=Q     d1=N
 * move_dest_fmt        = <ToFile><ToRank>
 *     e.g.               e4       d7
 * dest_check_fmt       = <Dest> <Check/Mate>
 *     e.g.               e4 +     d1=Q ≠
 */
"move_origin_fmt"       = "%@%c%c";
"drop_origin_fmt"       = "%@";
"operation_fmt"         = "%C";
"promo_dest_fmt"        = "%c%c=%@";
"move_dest_fmt"         = "%c%c";
"dest_check_fmt"        = "%@ %@";

/* Draw / Takeback requests */
"draw_request_text"     = "Your opponent offers a draw.";
"draw_request_yes"      = "Accept";
"draw_request_no"       = "Refuse";
"takeback_request_text" = "Your opponent would like to take back the last move.";
"takeback_request_yes"  = "Allow";
"takeback_request_no"   = "Refuse";
"takeback_refused"      = "Your opponent refused to let you take back this move.";
"takeback_refused_ok"   = "OK";

/* Game loading messages */
"game_load_fail"        = "Failed to load game";
"game_load_fail_msg"    = "Chess was unable to load the specified game file. The file may be corrupt or in an improper format.";

/* Style names */
"Wood"		= "Wood";
"Metal"		= "Metal";
"Marble"	= "Marble";
"Grass"		= "Grass";
"Fur"		= "Fur";
"Glass"		= "Glass";

/* Game menu items for recording
 *
 * menu_item_record_fmt         = "Record <Window Title>"
 * menu_item_stop_recording_fmt = "Stop Recording <Window Title>"
 */
"menu_item_record_game"        = "Record Game";
"menu_item_stop_recording"     = "Stop Recording";
"menu_item_record_fmt"         = "Record %@";
"menu_item_stop_recording_fmt" = "Stop Recording %@";

"recorded_game_file_name"      = "Chess Recording";
"recorded_game_file_name_fmt"  = "%@ %@.%@";

/* iOS UIKit shell strings.  These keep the existing local product surface
 * on the same localization table as the macOS Chess strings. */
"ios_variant_regular" = "Regular";
"ios_variant_crazyhouse" = "Crazyhouse";
"ios_variant_suicide" = "Suicide";
"ios_variant_losers" = "Losers";
"ios_players_human_human" = "Human vs. Human";
"ios_players_human_computer" = "Human vs. Computer";
"ios_players_computer_human" = "Computer vs. Human";
"ios_players_computer_computer" = "Computer vs. Computer";
"ios_side_white" = "White";
"ios_side_black" = "Black";
"ios_side_either" = "Either";
"ios_chess_title" = "Chess";
"ios_white_wins" = "White wins!";
"ios_black_wins" = "Black wins!";
"ios_draw" = "Draw!";
"ios_black_to_move" = "Black to Move";
"ios_white_to_move" = "White to Move";
"ios_start_new_game_title" = "Start a New Game?";
"ios_new_game_subtitle" = "Choose the same local game options as Apple Chess.";
"ios_variant_label" = "Variant";
"ios_players_label" = "Players";
"ios_side_label" = "Playing";
"ios_side_hint" = "For a local human versus computer game, choose the human side.";
"ios_computer_strength" = "Computer strength";
"ios_faster" = "Faster";
"ios_stronger" = "Stronger";
"ios_side_note" = "Side is used for local human/computer games; Human vs. Human and Computer vs. Computer keep their natural side sets.";
"ios_cancel" = "Cancel";
"ios_cancel_new_game" = "Cancel";
"ios_start" = "Start";
"ios_start_new_game" = "Start";
"ios_preferences" = "Preferences…";
"ios_chess_preferences" = "Preferences";
"ios_board_piece_style" = "Style";
"ios_rotate_after_move" = "Rotate after each move";
"ios_rotate_board_after_move" = "Rotate after each move";
"ios_board_and_pieces" = "Board / Pieces";
"ios_rotate_after_move_row" = "Rotate after each move";
"ios_actions" = "Moves";
"ios_chess_actions" = "Moves";
"ios_open" = "Open…";
"ios_save" = "Save";
"ios_record" = "Record Game";
"ios_stop" = "Stop Recording";
"ios_recording" = "Recording";
"ios_start_stop_recording" = "Start or stop a ReplayKit screen recording";
"ios_game_actions" = "Moves";
"ios_take_back" = "Take Back Move";
"ios_resign" = "Resign";
"ios_offer_draw" = "Offer Draw";
"ios_show_hint" = "Show Hint";
"ios_show_last_move" = "Show Last Move";
"ios_hide_edge_labels" = "Hide Edge Labels";
"ios_show_edge_labels" = "Show Edge Labels";
"ios_game_information" = "Edit Game Information";
"ios_resign_game_title" = "Resign Game?";
"ios_resign_game_message" = "End this game and declare the other side the winner?";
"ios_declare_draw_title" = "Declare a Draw?";
"ios_declare_draw_message" = "End this local game as a draw?";
"ios_draw_action" = "Draw!";
"ios_reset_camera" = "Reset Camera";
"ios_restore_default_board_view" = "Restore the default board view";
"ios_game_result" = "Game result";
"ios_export_game" = "Export game";
"ios_chess_game_format" = "Chess game (.game)";
"ios_pgn_format" = "Portable Game Notation (.pgn)";
"ios_ok" = "OK";
"ios_document_operation_failed" = "The document operation failed.";
"ios_no_active_game_export" = "Chess has no active game to export.";
"ios_screen_recording_unavailable" = "Screen recording is unavailable in this runtime.";
"ios_metal_unavailable" = "Metal is unavailable on this device";
"ios_edit_game_information" = "Edit Game Information";
"ios_editable_game_information" = "Edit Game Information";
"ios_edit" = "Edit";
"ios_game_status" = "Game status";
"ios_game_summary" = "Game summary";
"ios_no_moves_yet" = "No moves yet";
"ios_one_full_move" = "1 full move";
"ios_full_moves" = "%ld full moves";
"ios_move_row_detail" = "White  %@    Black  %@";
"ios_move_row_accessibility" = "Move %ld. White %@. Black %@";
"ios_not_played" = "not played";
"ios_document_export_extension" = "Chess exports must use .game or .pgn.";
"ios_document_stage_export" = "Chess could not stage the export file.";
"ios_document_no_presenter" = "Chess has no view controller to present the document picker.";
"ios_document_provider_no_url" = "The document provider returned no URL.";
"ios_document_unsupported_file" = "The selected file is not a supported Chess document.";
"ios_document_export_cancelled" = "The document export was cancelled.";
"ios_document_import_cancelled" = "The document import was cancelled.";
"ios_recording_invalid_url" = "Recording output must be a file URL.";
"ios_recording_already_active" = "A recording is already active.";
"ios_recording_unavailable" = "ReplayKit is unavailable in this runtime.";
"ios_recording_invalid_video_format" = "ReplayKit returned an invalid video format.";
"ios_recording_create_writer" = "Unable to create the MP4 writer.";
"ios_recording_attach_writer" = "Unable to attach the video writer input.";
"ios_recording_start_writer" = "Unable to start the MP4 writer.";
"ios_recording_reject_sample" = "The MP4 writer rejected a video sample.";
"ios_recording_not_active" = "No recording is active.";
"ios_recording_no_video" = "ReplayKit stopped without delivering a video frame.";

"ios_metadata_white" = "White";
"ios_metadata_black" = "Black";
"ios_metadata_city" = "Town/City";
"ios_metadata_country" = "Country";
"ios_metadata_event" = "Event";

"ios_store_app_support_unavailable" = "The application support directory is unavailable.";
"ios_store_invalid_game_save" = "Cannot save an invalid Chess game.";
"ios_store_invalid_game_load" = "Cannot load an invalid Chess game request.";
"ios_store_invalid_dictionary" = "The game file is not a property-list dictionary.";
"ios_store_missing_fields" = "The game file is missing required fields.";
"ios_store_missing_players" = "The game file has no side or player-type fields.";
"ios_store_unsupported_variant" = "The game file contains an unsupported variant or side.";
"ios_store_pgn_ambiguous" = "PGN move %@ is ambiguous.";
"ios_store_pgn_illegal" = "PGN move %@ is illegal or unsupported.";
"ios_store_invalid_export" = "Cannot export an invalid Chess game.";
"ios_store_export_open" = "The sandbox export file could not be opened.";
"ios_store_pgn_import_incomplete" = "The PGN import request is incomplete.";
"ios_store_pgn_variant_unsupported" = "The PGN variant is not supported by Chess.";
"ios_store_pgn_invalid_side" = "The PGN contains an invalid side value.";
"ios_store_pgn_fen_mismatch" = "PGN move replay did not produce its declared FEN.";
"ios_store_opening_book_missing" = "Opening book %@ is not bundled.";
"ios_no_active_game_save" = "Chess has no active board to save.";
/* iOS spoken-move preferences. */
"ios_speak_computer_moves" = "Speak Computer Moves";
"ios_speak_human_moves" = "Speak Human Moves";
"ios_primary_voice" = "Primary Voice";
"ios_alternate_voice" = "Alternate Voice";
"ios_system_default_voice" = "Default Voice";

/* macOS Chess Board/MainMenu wording for the iOS interface. */
"ios_players_game_center" = "Game Center Match";
"ios_board_style" = "Board";
"ios_piece_style" = "Pieces";
"ios_chess_section" = "Chess";
"ios_game_section" = "Game";
"ios_new_game" = "New…";
"ios_recent_games" = "Open Recent";
"ios_open_recent" = "Open Recent";
"ios_save_game_as" = "Save As…";
"ios_game_log" = "Game Log";
"ios_about_chess" = "About Chess";
"ios_new_menu" = "New…";
"ios_edge_notation" = "Edge Notation";

/* iOS board controls and handoff wording. */
"ios_view_section" = "View";
"ios_hide_controls" = "Hide Controls";
"ios_show_controls" = "Show Controls";
"ios_board_only_hint" = "Tap an empty square to show controls.";
"ios_flip_board" = "Flip Board";
"ios_shared_board_options" = "Shared Board Options";
"ios_confirm_next_turn" = "Confirm Next Turn";
"ios_keep_display_awake" = "Keep Display Awake While Playing";
"ios_next_turn_ready" = "Ready for Next Turn";
"ios_pass_device" = "Pass the device, then tap Continue.";
"ios_continue" = "Continue";
"ios_on" = "On";
"ios_off" = "Off";
"ios_speech" = "Speech";
"ios_controls_visible_voiceover" = "Controls stay visible while VoiceOver is on.";
"ios_chess_help" = "Chess Help";
"ios_saved_games" = "Saved Games";
"ios_clear_menu" = "Clear Menu";
"ios_delete_game" = "Delete Game";
"ios_delete_game_message" = "Delete this saved game? This cannot be undone.";
"ios_draw_offer_pending" = "Draw offer will accompany your next move.";
"ios_preview_voice" = "Preview Voice";
"ios_close_game_before_delete" = "Close this game before deleting it.";
"ios_human_player" = "Human";
"ios_enter_move_shortcut" = "⌘↩";
"ios_done" = "Done";
"ios_enter_move" = "Enter Move";
"ios_game_center_achievements" = "Achievements";
"ios_game_center_finished" = "Finished";
"ios_game_center_matches" = "Existing Matches";
"ios_game_center_no_matches" = "No existing matches";
"ios_game_center_opponent" = "Opponent";
"ios_game_center_waiting" = "Waiting";
"ios_game_center_your_turn" = "Your turn";
"ios_game_name" = "Game name";
"ios_imported_game" = "Imported Game";
"ios_keep_playing" = "Keep Playing";
"ios_local_game" = "Local Game";
"ios_new_game_name_default" = "New Game";
"ios_new_window" = "New Window";
"ios_no_saved_games" = "No saved games";
"ios_rename_game" = "Rename Game";
"ios_save_copy" = "Save Copy";
"ios_save_game" = "Save Game";
"ios_share_last_recording" = "Share Last Recording";
"ios_game_copy_suffix" = " Copy";
"ios_recovered_game_prefix" = "Recovered ";
"ios_game_center" = "Game Center";
"ios_casual_game_name" = "Casual Game";
"ios_game_center_game_name" = "Game Center %@";
